# Regiment

### Introduction:

Special thanks to: http://chrisalbon.com/ for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

In [2]:
import numpy as np

### Step 2. Create the DataFrame with the following values:

In [4]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

### Step 3. Assign it to a variable called regiment.
#### Don't forget to name each column

In [9]:
columns = ['regiment', 'company', 'name', 'preTestScore', 'postTestScore']

In [14]:
#regiment = pd.DataFrame(columns=columns) regiment = pd.DataFrame(raw_data) #---Another approach

In [15]:
regiment = pd.DataFrame(raw_data, columns=columns)

In [16]:
regiment

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

### Step 4. What is the mean preTestScore from the regiment Nighthawks?

In [20]:
regiment[regiment['regiment'] == 'Nighthawks']['preTestScore'].mean()

15.25

### Step 5. Present general statistics by company

In [22]:
regiment.company.describe()

count      12
unique      2
top       1st
freq        6
Name: company, dtype: object

### Step 6. What is the mean each company's preTestScore?

In [23]:
regiment.groupby('company')['preTestScore'].mean()

company
1st     6.666667
2nd    15.500000
Name: preTestScore, dtype: float64

### Step 7. Present the mean preTestScores grouped by regiment and company

In [25]:
regiment.groupby(['regiment','company'])['preTestScore'].mean()

regiment    company
Dragoons    1st         3.5
            2nd        27.5
Nighthawks  1st        14.0
            2nd        16.5
Scouts      1st         2.5
            2nd         2.5
Name: preTestScore, dtype: float64

### Step 8. Present the mean preTestScores grouped by regiment and company without heirarchical indexing

In [35]:
regiment.groupby(['regiment','company'], as_index=False)['preTestScore'].mean()

     regiment company  preTestScore
0    Dragoons     1st           3.5
1    Dragoons     2nd          27.5
2  Nighthawks     1st          14.0
3  Nighthawks     2nd          16.5
4      Scouts     1st           2.5
5      Scouts     2nd           2.5

### Step 9. Group the entire dataframe by regiment and company

In [28]:
regiment.groupby(['regiment','company']).groups

{('Dragoons', '1st'): Int64Index([4, 5], dtype='int64'),
 ('Dragoons', '2nd'): Int64Index([6, 7], dtype='int64'),
 ('Nighthawks', '1st'): Int64Index([0, 1], dtype='int64'),
 ('Nighthawks', '2nd'): Int64Index([2, 3], dtype='int64'),
 ('Scouts', '1st'): Int64Index([8, 9], dtype='int64'),
 ('Scouts', '2nd'): Int64Index([10, 11], dtype='int64')}

### Step 10. What is the number of observations in each regiment and company

In [29]:
pd.DataFrame(regiment.groupby(['regiment','company']).size().reset_index(name = "Group_Count"))

     regiment company  Group_Count
0    Dragoons     1st            2
1    Dragoons     2nd            2
2  Nighthawks     1st            2
3  Nighthawks     2nd            2
4      Scouts     1st            2
5      Scouts     2nd            2

### Step 11. Iterate over a group and print the name and the whole data from the regiment

In [37]:
df_groups = regiment.groupby(['regiment','company'])

In [42]:
for name,group in df_groups:
    print('ID: ' + str(name))
    print(group)
    print("\n")
    #group.head(10)  -- Print top 10 record from each group

ID: ('Dragoons', '1st')
   regiment company   name  preTestScore  postTestScore
4  Dragoons     1st  Cooze             3             70
5  Dragoons     1st  Jacon             4             25


ID: ('Dragoons', '2nd')
   regiment company    name  preTestScore  postTestScore
6  Dragoons     2nd  Ryaner            24             94
7  Dragoons     2nd    Sone            31             57


ID: ('Nighthawks', '1st')
     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94


ID: ('Nighthawks', '2nd')
     regiment company    name  preTestScore  postTestScore
2  Nighthawks     2nd     Ali            31             57
3  Nighthawks     2nd  Milner             2             62


ID: ('Scouts', '1st')
  regiment company   name  preTestScore  postTestScore
8   Scouts     1st  Sloan             2             62
9   Scouts     1st  Piger             3             70


ID: ('Scouts', '2nd')
   regiment company   name  preTestScore  postTestScore
10   Scouts     2nd  Riani             2             62
11   Scouts     2nd    Ali             3             70